export const provinceLayout = [
  {
    "name": "เชยงราย",
    "x": 2,
    "y": 0
  },
  {
    "name": "เชยงใหม",
    "x": 0,
    "y": 1
  },
  {
    "name": "ลำปาง",
    "x": 1,
    "y": 1
  },
  {
    "name": "พะเยา",
    "x": 2,
    "y": 1
  },
  {
    "name": "แมฮองสอน",
    "x": 0,
    "y": 2
  },
  {
    "name": "ลำพน",
    "x": 1,
    "y": 2
  },
  {
    "name": "อตรดตถ",
    "x": 2,
    "y": 2
  },
  {
    "name": "นาน",
    "x": 3,
    "y": 2
  },
  {
    "name": "แพร",
    "x": 0,
    "y": 3
  },
  {
    "name": "สโขทย",
    "x": 1,
    "y": 3
  },
  {
    "name": "พษณโลก",
    "x": 2,
    "y": 3
  },
  {
    "name": "เพชรบรณ",
    "x": 3,
    "y": 3
  },
  {
    "name": "หนองคาย",
    "x": 5,
    "y": 3
  },
  {
    "name": "บงกาฬ",
    "x": 6,
    "y": 3
  },
  {
    "name": "นครพนม",
    "x": 7,
    "y": 3
  },
  {
    "name": "ตาก",
    "x": 1,
    "y": 4
  },
  {
    "name": "กำแพงเพชร",
    "x": 2,
    "y": 4
  },
  {
    "name": "พจตร",
    "x": 3,
    "y": 4
  },
  {
    "name": "เลย",
    "x": 5,
    "y": 4
  },
  {
    "name": "อดรธาน",
    "x": 6,
    "y": 4
  },
  {
    "name": "สกลนคร",
    "x": 7,
    "y": 4
  },
  {
    "name": "นครสวรรค",
    "x": 3,
    "y": 5
  },
  {
    "name": "หนองบวลำภ",
    "x": 5,
    "y": 5
  },
  {
    "name": "ขอนแกน",
    "x": 6,
    "y": 5
  },
  {
    "name": "กาฬสนธ",
    "x": 7,
    "y": 5
  },
  {
    "name": "มกดาหาร",
    "x": 8,
    "y": 5
  },
  {
    "name": "อทยธาน",
    "x": 3,
    "y": 6
  },
  {
    "name": "ชยนาท",
    "x": 4,
    "y": 6
  },
  {
    "name": "ชยภม",
    "x": 6,
    "y": 6
  },
  {
    "name": "มหาสารคาม",
    "x": 7,
    "y": 6
  },
  {
    "name": "รอยเอด",
    "x": 8,
    "y": 6
  },
  {
    "name": "กาญจนบร",
    "x": 2,
    "y": 7
  },
  {
    "name": "สพรรณบร",
    "x": 3,
    "y": 7
  },
  {
    "name": "สงหบร",
    "x": 4,
    "y": 7
  },
  {
    "name": "ลพบร",
    "x": 5,
    "y": 7
  },
  {
    "name": "นครราชสมา",
    "x": 6,
    "y": 7
  },
  {
    "name": "บรรมย",
    "x": 7,
    "y": 7
  },
  {
    "name": "สรนทร",
    "x": 8,
    "y": 7
  },
  {
    "name": "ยโสธร",
    "x": 9,
    "y": 7
  },
  {
    "name": "อำนาจเจรญ",
    "x": 10,
    "y": 7
  },
  {
    "name": "นครปฐม",
    "x": 3,
    "y": 8
  },
  {
    "name": "อางทอง",
    "x": 4,
    "y": 8
  },
  {
    "name": "พระนครศรอยธยา",
    "x": 5,
    "y": 8
  },
  {
    "name": "สระบร",
    "x": 6,
    "y": 8
  },
  {
    "name": "ปราจนบร",
    "x": 7,
    "y": 8
  },
  {
    "name": "สระแกว",
    "x": 8,
    "y": 8
  },
  {
    "name": "ศรสะเกษ",
    "x": 9,
    "y": 8
  },
  {
    "name": "อบลราชธาน",
    "x": 10,
    "y": 8
  },
  {
    "name": "ราชบร",
    "x": 3,
    "y": 9
  },
  {
    "name": "นนทบร",
    "x": 4,
    "y": 9
  },
  {
    "name": "ปทมธาน",
    "x": 5,
    "y": 9
  },
  {
    "name": "นครนายก",
    "x": 6,
    "y": 9
  },
  {
    "name": "สมทรสงคราม",
    "x": 3,
    "y": 10
  },
  {
    "name": "สมทรสาคร",
    "x": 4,
    "y": 10
  },
  {
    "name": "กรงเทพมหานคร",
    "x": 5,
    "y": 10
  },
  {
    "name": "ฉะเชงเทรา",
    "x": 6,
    "y": 10
  },
  {
    "name": "เพชรบร",
    "x": 3,
    "y": 11
  },
  {
    "name": "สมทรปราการ",
    "x": 5,
    "y": 11
  },
  {
    "name": "ชลบร",
    "x": 6,
    "y": 11
  },
  {
    "name": "ประจวบครขนธ",
    "x": 3,
    "y": 12
  },
  {
    "name": "ระยอง",
    "x": 6,
    "y": 12
  },
  {
    "name": "จนทบร",
    "x": 7,
    "y": 12
  },
  {
    "name": "ชมพร",
    "x": 3,
    "y": 13
  },
  {
    "name": "ตราด",
    "x": 8,
    "y": 13
  },
  {
    "name": "ระนอง",
    "x": 2,
    "y": 14
  },
  {
    "name": "สราษฎรธาน",
    "x": 3,
    "y": 14
  },
  {
    "name": "พงงา",
    "x": 2,
    "y": 15
  },
  {
    "name": "กระบ",
    "x": 3,
    "y": 15
  },
  {
    "name": "นครศรธรรมราช",
    "x": 4,
    "y": 15
  },
  {
    "name": "ภเกต",
    "x": 1,
    "y": 16
  },
  {
    "name": "ตรง",
    "x": 3,
    "y": 16
  },
  {
    "name": "พทลง",
    "x": 4,
    "y": 16
  },
  {
    "name": "สตล",
    "x": 3,
    "y": 17
  },
  {
    "name": "สงขลา",
    "x": 4,
    "y": 17
  },
  {
    "name": "ปตตาน",
    "x": 5,
    "y": 17
  },
  {
    "name": "ยะลา",
    "x": 4,
    "y": 18
  },
  {
    "name": "นราธวาส",
    "x": 5,
    "y": 18
  }
];
